# Leçon SQL 9: Requêtes avec des expressions

En plus d'interroger et de référencer des données de colonne brutes avec SQL, vous pouvez également utiliser des expressions pour écrire une logique plus complexe sur les valeurs de colonne dans une requête.

Ces expressions peuvent utiliser des fonctions mathématiques et de chaîne avec l'arithmétique de base pour transformer les valeurs lorsque la requête est exécutée, comme illustré dans cet exemple de physique.

Exemple de requête avec des expressions
``` mysql 
SELECT particle_speed / 2.0 AS half_particle_speed
FROM physics_data
WHERE ABS(particle_position) * 10.0 > 500;
```

Chaque base de données possède son propre ensemble pris en charge de fonctions mathématiques, de chaîne et de date qui peuvent être utilisées dans une requête, que vous pouvez trouver dans leurs propres documents respectifs.

L'utilisation d'expressions peut gagner du temps et un post-traitement supplémentaire des données de résultat, mais peut également rendre la requête plus difficile à lire, nous recommandons donc que lorsque des expressions sont utilisées dans la **SELECT** partie de la requête, elles reçoivent également un alias descriptif en utilisant le mot - clé **AS**.

Sélectionnez une requête avec des alias d'expression
``` mysql 
SELECT col_expression AS expr_description, …
FROM mytable;
```

En plus des expressions, les colonnes régulières et même les tables peuvent également avoir des alias pour les rendre plus faciles à référencer dans la sortie et dans le cadre de la simplification des requêtes plus complexes.

Exemple de requête avec des alias de nom de colonne et de table
``` mysql 
SELECT column AS better_column_name, …
FROM a_long_widgets_table_name AS mywidgets
INNER JOIN widget_sales
  ON mywidgets.id = widget_sales.widget_id;
```

## Exercice

Vous allez devoir utiliser des expressions pour transformer les données **BoxOffice** en quelque chose de plus facile à comprendre pour les tâches ci-dessous.

**IMPORTANT : Afin de répondre aux questions de l'exercise d'insérer la requête entre les doubles quotes " "**

In [1]:
import pandas as pd

def to_df(s):
    l= [elt.split(';') for elt in s.replace("	", ";").split('\n')]
    return pd.DataFrame(l[1:], columns=l[0])

In [2]:
from pandasql import sqldf

In [3]:
x="""Id	Title	Director	Year	Length_minutes
1	Toy Story	John Lasseter	1995	81
2	A Bug's Life	John Lasseter	1998	95
3	Toy Story 2	John Lasseter	1999	93
4	Monsters, Inc.	Pete Docter	2001	92
5	Finding Nemo	Andrew Stanton	2003	107
6	The Incredibles	Brad Bird	2004	116
7	Cars	John Lasseter	2006	117
8	Ratatouille	Brad Bird	2007	115
9	WALL-E	Andrew Stanton	2008	104
10	Up	Pete Docter	2009	101
11	Toy Story 3	Lee Unkrich	2010	103
12	Cars 2	John Lasseter	2011	120
13	Brave	Brenda Chapman	2012	102
14	Monsters University	Dan Scanlon	2013	110"""
Movies = to_df(x)

In [4]:
Movies

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110

In [5]:
y="""Movie_id	Rating	Domestic_sales	International_sales
5	8.2	380843261	555900000
14	7.4	268492764	475066843
8	8	206445654	417277164
12	6.4	191452396	368400000
3	7.9	245852179	239163000
6	8	261441092	370001000
9	8.5	223808164	297503696
11	8.4	415004880	648167031
1	8.3	191796233	170162503
7	7.2	244082982	217900167
10	8.3	293004164	438338580
4	8.1	289916256	272900000
2	7.2	162798565	200600000
13	7.2	237283207	301700000"""

In [6]:
BoxOffice = to_df(y)

In [7]:
BoxOffice

   Movie_id Rating Domestic_sales International_sales
0         5    8.2      380843261           555900000
1        14    7.4      268492764           475066843
2         8      8      206445654           417277164
3        12    6.4      191452396           368400000
4         3    7.9      245852179           239163000
5         6      8      261441092           370001000
6         9    8.5      223808164           297503696
7        11    8.4      415004880           648167031
8         1    8.3      191796233           170162503
9         7    7.2      244082982           217900167
10       10    8.3      293004164           438338580
11        4    8.1      289916256           272900000
12        2    7.2      162798565           200600000
13       13    7.2      237283207           301700000

1. Énumérez tous les films et leurs ventes combinées en millions de dollars

In [15]:
QUERY1 = "select title, domestic_sales+international_sales as 'nb ventes' from Movies inner join BoxOffice on Movies.id=BoxOffice.Movie_id"

In [16]:
sqldf(QUERY1)

                  Title   nb ventes
0             Toy Story   361958736
1          A Bug's Life   363398565
2           Toy Story 2   485015179
3        Monsters, Inc.   562816256
4          Finding Nemo   936743261
5       The Incredibles   631442092
6                  Cars   461983149
7           Ratatouille   623722818
8                WALL-E   521311860
9                    Up   731342744
10          Toy Story 3  1063171911
11               Cars 2   559852396
12                Brave   538983207
13  Monsters University   743559607

2. Lister tous les films et leurs notes en pourcentage

In [19]:
QUERY2 = "select title, rating, sum(rating)*rating/100 from Movies inner join BoxOffice on Movies.id=BoxOffice.Movie_id"

In [20]:
sqldf(QUERY2)

       Title Rating  sum(rating)*rating/100
0  Toy Story    8.3                  9.0553

3. Répertoriez tous les films sortis les années paires

In [16]:
QUERY3 = ""

In [17]:
sqldf(QUERY3)

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110